[
  {
    "product_id": "12c3fc64-d850-49ce-881e-a50b6586ce5e",
    "name": "Laura Mercier Caviar Stick Eye Color Sugar Frost 1.64g/0.05oz",
    "description": "Product: Laura Mercier Laura Mercier Caviar Stick Eye Color Sugar Frost 1.64g/0.05oz\n\nDescription: A versatile and easy-to-use cream eye shadow stick that delivers effortless application, intense buildable color, up to 12-hour long lasting wear, and a range of pigment-rich shades in creamy shimmer and matte finishes. The Caviar Stick Eye Color glides smoothly onto lids, making it perfect for long-lasting, effortless eye makeup. The key features include a versatile cream eye shadow stick, easy-to-use application, intense buildable color, up to 12-hour long lasting wear, and a range of pigment-rich shades in creamy shimmer and matte finishes. The best for is a range of pigment-rich sh",
    "price": 2.29,
    "categories": [
      "Beauty",
      "Makeup",
      "Eye Makeup",
      "Eye Shadow",
      "Eye Shadow Stick"
    ],
    "brand": "Laura Mercier",
    "in_stock": true,
    "image_url": "https://i5.walmartimages.com/seo/Laura-Mercier-Caviar-Stick-Eye-Color-Sugar-Frost-1-64g-0-05oz_55297223-7af5-4a30-83c2-4d74d08969e3.8ca12dd7578ff564b6e01923e85ffd11.jpeg",
    "region": "US",
    "monthly_installment": 0.19
  },
  {
    "product_id": "12bb18dd-1220-41f4-b05f-61c99b5a5973",
    "name": "Exultantex Grey Blackout Curtains for Living Room,Pom Pom Thermal Window Curtains,50\"W x 95\"L, 2 Panels, Rod Pocket",
    "description": "Product: Exultantex Exultantex Grey Blackout Curtains for Living Room, Pom Pom Thermal Window Curtains, 50\"W x 95\"L, 2 Panels, Rod Pocket\n\nDescription:\n- Soft triple weave fabric with a velvet-like texture\n- Each panel measures 50\"W x 95\"L, sold in a set of 2 panels\n- Adorned with charming gray pom-pom trimmings for a cozy atmosphere\n- Suitable for various rooms: living room, kids room, bedroom, guest room\n- Provides noise reduction and blocks at least 81% of light and UV radiation\n- Thermal insulated to balance room temperature and reduce energy bills\n- Easy installation with 3-inch rod pocket header\n- Available in multiple colors and\n- Best for\n- Provides",
    "price": 4.788,
    "categories": [
      "Home",
      "Decor",
      "Curtains & Window Treatments",
      "Curtains",
      "Blackout Curtains"
    ],
    "brand": "Exultantex",
    "in_stock": true,
    "image_url": "https://i5.walmartimages.com/seo/Exultantex-Grey-Blackout-Curtains-for-Living-Room-Pom-Pom-Thermal-Window-Curtains-50-W-x-95-L-2-Panels-Rod-Pocket_f89aea0d-9d30-4bce-b65e-8c15732f1ca4.b20ae059333c322a0c8ea79bd569c7c7.jpeg",
    "region": "US",
    "monthly_installment": 0.4
  },
  {
    "product_id": "955d579c-8967-4fe1-902a-45747a57766f",
    "name": "Jessica London Women's Plus Size Stretch Knit V-Neck Swing Tunic",
    "description": "Product: Jessica London Women's Plus Size Stretch Knit V-Neck Swing Tunic\n\nDescription: A versatile and stylish tunic with a V-neckline, short sleeves, and a trapeze silhouette that flatter every body type. The trapeze silhouette is perfect for everyday wear, and the short sleeves add a touch of elegance. The tunic is made of a blend of rayon and spandex, making it comfortable and breathable. The brand, Style To Live By, specializes in fashionable and affordable clothing for women.",
    "price": 3.324,
    "categories": [
      "Clothing",
      "Womens Plus",
      "Plus Size Tops",
      "Plus Size Tops"
    ],
    "brand": "Jessica London",
    "in_stock": true,
    "image_url": "https://i5.walmartimages.com/seo/Jessica-London-Women-s-Plus-Size-Stretch-Knit-V-Neck-Swing-Tunic-1X-Raspberry_ad301f95-eee5-46f0-a07d-84befa229aee.b557dcd55539425f75e07446439149ca.jpeg",
    "region": "US",
    "monthly_installment": 0.28
  }
]